-Κανόνες Μεταγλώτισης του Κώδικα Bash

-Αυτό το αρχείο περιγράφει τους κανόνες και τις οδηγίες για τη μετάγλωτση του παρακάτω script, το οποίο προσομοιώνει μια επικοινωνία μεταξύ Server και 5 Clients οι οποίοι επιλέγουν διάφορα προϊόντα και τα παραγγέλνουν.

-Οδηγίες πριν την εκτέλεση:
μπείτε στο παρακάτω λινκ: (**λινκ**) και κατεβάστε τα αρχεία ή αντιγράφτε τα και αποθηκεύστε τα ως αρχεία C προγρμματισμού(.c).
Ύστερα μετακινηθείτε στον φάκελο όπου αποθηκεύτηκαν τα αρχεία 

-Requierements:
OS: οποιοδήποτε linux λογισμικό (ή Virtual Machine με Linux)


-Files:

server.c: περιέχει τον κώδικα με τις λειτουργίες του server
client.c: περιέχει τον κώδικα με τις λειτουργίες του client

-Πώς να εκτελέσετε:
ανοίχτε 2 ξεχωριστά tabs στο terminal (αφότου έχετε κατεβάσει τα αρχεία). 
Υστερα πληκτρολογήστε τα ονόματα των 2 αρχείων (χωρίς να πατήσετε enter) και κατόπιν πατήστε enter στο αρχείο του client.
